#!/bin/sh
#
# DECCARA による色変更テストプログラム
# 大文字の行と小文字の行の表示が同じならば OK
#

printf '\033[H\033[2J'

printf 'A: '
printf 'xxx\033[4mxx\033[1;5;31;43mXX\033[24mXXX\033[mｘｘｘ\033[4mｘｘ\033[1;5;31;43mＸＸ\033[24mＸ\033[4mＸＸＸ\033[24mＸ\033[m'
printf 'xxx\033[34mxx\033[1;5;43mXX\033[31mXXXＸ\033[34mＸＸＸ\033[31mＸ\033[m'
printf 'xxx\033[46mxx\033[1;5;31;46mXX\033[43mXXXＸ\033[46mＸＸＸ\033[43mＸ\033[m\n'
printf 'a: \033[0*x'
printf 'xxxxx\033[1;5;31;43mXXXXX\033[mｘｘｘｘｘ\033[1;5;31;43mＸＸＸＸＸＸＸ\033[m'
printf 'xxxxx\033[1;5;31;43mXXXXXＸＸＸＸＸ\033[m'
printf 'xxxxx\033[1;5;31;43mXXXXXＸＸＸＸＸ\033[m'
printf '\n'
printf '\033[2;7;2;10;4$r'
printf '\033[2;21;2;26;4$r'
printf '\033[2;31;2;34;4$r'
printf '\033[2;41;2;44;34$r'
printf '\033[2;51;2;54;34$r'
printf '\033[2;61;2;64;46$r'
printf '\033[2;71;2;74;46$r'

printf '\n'

printf 'B: '
printf 'xxx\033[4mxx\033[1;5;31;43mXX\033[24mXXX\033[mｘｘｘ\033[4mｘｘ\033[1;5;31;43mＸＸ\033[24mＸ\033[4mＸＸＸ\033[24mＸ\033[m'
printf 'xxx\033[34mxx\033[1;5;43mXX\033[31mXXXＸ\033[34mＸＸＸ\033[31mＸ\033[m'
printf 'xxx\033[46mxx\033[1;5;31;46mXX\033[43mXXXＸ\033[46mＸＸＸ\033[43mＸ\033[m\n'
printf 'b: \033[2*x'
printf 'xxxxx\033[1;5;31;43mXXXXX\033[mｘｘｘｘｘ\033[1;5;31;43mＸＸＸＸＸＸＸ\033[m'
printf 'xxxxx\033[1;5;31;43mXXXXXＸＸＸＸＸ\033[m'
printf 'xxxxx\033[1;5;31;43mXXXXXＸＸＸＸＸ\033[m'
printf '\n'
printf '\033[5;7;5;10;4$r'
printf '\033[5;21;5;26;4$r'
printf '\033[5;31;5;34;4$r'
printf '\033[5;41;5;44;34$r'
printf '\033[5;51;5;54;34$r'
printf '\033[5;61;5;64;46$r'
printf '\033[5;71;5;74;46$r'

printf '\033[0*x\n'

printf 'C: \033[1;5;31;43mＸ\033[4mＸＸＸＸＸＸＸＸＸＸ\033[34mＸＸＸＸＸＸＸＸＸＸ\033[46mＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸ\033[22;25m\033[32;7;78;7;9999$x\n'
printf 'C: \033[1;5mＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸ\033[22;25m\033[32;8;78;8;9999$x\n'
printf 'C: \033[1;5mXＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸX\033[22;25m\033[32;9;78;9;9999$x\n'
printf 'C: \033[1;5mＸＸＸＸＸＸＸ\033[24mＸＸＸＸＸＸＸＸＸＸ\033[31mＸＸＸＸＸＸＸＸＸＸ\033[43mＸＸＸＸＸＸＸＸＸＸ\033[m\n'
printf 'c: \033[1;5;31;43mＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸ\033[m\n'
printf 'c: \033[1;5;31;43mＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸ\033[m\n'
printf 'c: \033[1;5;31;43mXＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸX\033[m\n'
printf 'c: \033[1;5;31;43mＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸ\033[m\n'
printf '\033[11;7;14;16;4$r'
printf '\033[11;27;14;36;34$r'
printf '\033[11;47;14;56;46$r'

printf '\033[2*x\n'

printf 'D: \033[1;5;31;43mＸ\033[4mＸＸＸＸＸＸ\033[24mＸＸＸＸ\033[34mＸＸＸＸＸＸ\033[31mＸＸＸＸ\033[46mＸＸＸＸＸＸ\033[43mＸＸＸＸＸＸＸＸＸＸ\033[m\n'
printf 'D: \033[1;5;31;43mＸ\033[4mＸＸＸＸＸＸ\033[24mＸＸＸＸ\033[34mＸＸＸＸＸＸ\033[31mＸＸＸＸ\033[46mＸＸＸＸＸＸ\033[43mＸＸＸＸＸＸＸＸＸＸ\033[m\n'
printf 'D: \033[1;5;31;43mXＸ\033[4mＸＸＸＸＸ\033[24mＸＸＸＸＸ\033[34mＸＸＸＸＸ\033[31mＸＸＸＸＸ\033[46mＸＸＸＸＸ\033[43mＸＸＸＸＸＸＸＸＸＸX\033[m\n'
printf 'D: \033[1;5;31;43mＸ\033[4mＸＸＸＸＸＸ\033[24mＸＸＸＸ\033[34mＸＸＸＸＸＸ\033[31mＸＸＸＸ\033[46mＸＸＸＸＸＸ\033[43mＸＸＸＸＸＸＸＸＸＸ\033[m\n'
printf 'd: \033[1;5;31;43mＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸ\033[m\n'
printf 'd: \033[1;5;31;43mＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸ\033[m\n'
printf 'd: \033[1;5;31;43mXＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸX\033[m\n'
printf 'd: \033[1;5;31;43mＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸ\033[m\n'
printf '\033[20;7;23;16;4$r'
printf '\033[20;27;23;36;34$r'
printf '\033[20;47;23;56;46$r'

printf '\033[0*x'
